In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
import json
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

username = 'root' 
password = 'root'

connection_str = "mysql+pymysql://root:root@localhost/movies"

In [2]:
engine = create_engine(connection_str)

In [3]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

In [4]:
basics_df = pd.read_csv('Data/title_basics.csv.gz')
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [5]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89149 entries, 0 to 89148
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          89149 non-null  object
 1   titleType       89149 non-null  object
 2   primaryTitle    89149 non-null  object
 3   originalTitle   89149 non-null  object
 4   isAdult         89149 non-null  int64
 5   startYear       86611 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  89149 non-null  int64
 8   genres          89149 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.1+ MB

In [6]:
basics_df['genres'].value_counts()

Drama                        17576
Comedy                        7315
Horror                        4263
Comedy,Drama                  4053
Drama,Romance                 2631
                             ...
Horror,Music,Mystery             1
Action,Crime,Musical             1
Comedy,History,Mystery           1
Animation,Biography,Sport        1
Biography,Fantasy,Musical        1
Name: genres, Length: 870, dtype: int64

In [7]:
basics_df['genres_split'] = basics_df['genres'].str.split(',')
basics_df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
89144,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
89145,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
89146,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
89147,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
89148,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [8]:
exploded_genres = basics_df.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
89147,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
89147,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
89147,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
89148,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
89148,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [9]:
genres_split = basics_df['genres'].str.split(",")

unique_genres = genres_split.explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Biography', 'Mystery', 'Musical', 'Action', 'Adventure', 'Crime',
       'Thriller', 'Music', 'Animation', 'Family', 'History', 'War',
       'Sport', 'Western', 'Adult', 'Short', 'Reality-TV', 'News',
       'Talk-Show', 'Game-Show'], dtype=object)

In [10]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [11]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres

          tconst genres_split
0      tt0035423       Comedy
0      tt0035423      Fantasy
0      tt0035423      Romance
1      tt0062336        Drama
2      tt0069049        Drama
...          ...          ...
89147  tt9916190       Action
89147  tt9916190    Adventure
89147  tt9916190     Thriller
89148  tt9916362        Drama
89148  tt9916362      History

[165797 rows x 2 columns]

In [12]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [13]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89149 entries, 0 to 89148
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          89149 non-null  object
 1   titleType       89149 non-null  object
 2   primaryTitle    89149 non-null  object
 3   originalTitle   89149 non-null  object
 4   isAdult         89149 non-null  int64
 5   startYear       86611 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  89149 non-null  int64
 8   genres          89149 non-null  object
 9   genres_split    89149 non-null  object
dtypes: float64(2), int64(2), object(6)
memory usage: 6.8+ MB

In [14]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [15]:
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
89147  tt9916190         0
89147  tt9916190         2
89147  tt9916190        23
89148  tt9916362         7
89148  tt9916362        11

[165797 rows x 2 columns]

In [16]:
## Manaully make a dataframe with the named cols from the .keyd and .values
genre_lookup = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})

In [17]:
genre_lookup

    genre_name  genre_id
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Short        20
21       Sport        21
22   Talk-Show        22
23    Thriller        23
24         War        24
25     Western        25

# New heading

In [18]:
basics_df.dtypes

tconst             object
titleType          object
primaryTitle       object
originalTitle      object
isAdult             int64
startYear         float64
endYear           float64
runtimeMinutes      int64
genres             object
genres_split       object
dtype: object

In [19]:
basics_df.drop(columns=['originalTitle', 'isAdult', 'titleType', 'genres', 'genres_split'], inplace = True)

In [20]:
basics_df

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70
2,tt0069049,The Other Side of the Wind,2018.0,NaN,122
3,tt0088751,The Naked Monster,2005.0,NaN,100
4,tt0096056,Crime and Punishment,2002.0,NaN,126
...,...,...,...,...,...
89144,tt9914942,Life Without Sara Amat,2019.0,NaN,74
89145,tt9915872,The Last White Witch,2019.0,NaN,97
89146,tt9916170,The Rehearsal,2019.0,NaN,51
89147,tt9916190,Safeguard,2020.0,NaN,95
89148,tt9916362,Coven,2020.0,NaN,92

# title_basics table to MySQL

In [21]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics_df['tconst'].fillna('').map(len).max()
title_len = basics_df['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
basics_df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [22]:
# Save to sql with dtype and index=False
basics_df.to_sql('title_basics',engine,dtype=basics_df_schema,if_exists='replace',index=False)

89149

In [23]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

# title_genres Table to MySQL

In [24]:
## Example
#from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
titleGenres_df_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Integer()}

In [25]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=titleGenres_df_schema,if_exists='replace',index=False)

165797

# genres Table to MySQL

In [26]:
## Example
#from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = genre_lookup['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
genreLookup_df_schema = {
    "genre_name": String(key_len+1), 
    'genre_id':Integer()}

In [27]:
genre_lookup.to_sql('genres',engine,dtype=genreLookup_df_schema,if_exists='replace',index=False)

26

In [28]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

# title_ratings Table to MySQL

In [29]:
ratings_df = pd.read_csv('Data/title_ratings.csv.gz')
ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1967
1  tt0000002            5.8       264
2  tt0000005            6.2      2610
3  tt0000006            5.2       181
4  tt0000007            5.4       816

In [30]:
ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 497338 entries, 0 to 497337
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         497338 non-null  object
 1   averageRating  497338 non-null  float64
 2   numVotes       497338 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.4+ MB

In [31]:
## Example
#from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = ratings_df['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
ratings_df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes': Integer()}

In [32]:
ratings_df.to_sql('title_ratings',engine,dtype=ratings_df_schema,if_exists='replace',index=False)

497338

In [33]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

# tmdb_data Table to MySQL

In [34]:
tmdb_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_df.head()

,index,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
1,2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
2,3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
3,4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.114,2188.0,PG
4,5,tt0118852,0.0,/vceiGZ3uavAEHlTA7v0GjQsGVKe.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,49511.0,en,...,0.0,99.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,There's a fine line between friendship and bet...,Chinese Coffee,0.0,6.800,49.0,R

In [35]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2565 entries, 0 to 2564
Data columns (total 27 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   index                  2565 non-null   int64
 1   imdb_id                2565 non-null   object
 2   adult                  2565 non-null   float64
 3   backdrop_path          1394 non-null   object
 4   belongs_to_collection  206 non-null    object
 5   budget                 2565 non-null   float64
 6   genres                 2565 non-null   object
 7   homepage               173 non-null    object
 8   id                     2565 non-null   float64
 9   original_language      2565 non-null   object
 10  original_title         2565 non-null   object
 11  overview               2514 non-null   object
 12  popularity             2565 non-null   float64
 13  poster_path            2308 non-null   object
 14  production_companies   2565 non-null   object
 15  production_countries   2565 non-null   object
 16  release_date           2547 non-null   object
 17  revenue                2565 non-null   float64
 18  runtime                2565 non-null   float64
 19  spoken_languages       2565 non-null   object
 20  status                 2565 non-null   object
 21  tagline                1099 non-null   object
 22  title                  2565 non-null   object
 23  video                  2565 non-null   float64
 24  vote_average           2565 non-null   float64
 25  vote_count             2565 non-null   float64
 26  certification          816 non-null    object
dtypes: float64(9), int64(1), object(17)
memory usage: 541.2+ KB

In [36]:
tmdb_keepers = tmdb_df[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb_keepers

        imdb_id     revenue      budget certification
0     tt0113026         0.0  10000000.0           NaN
1     tt0113092         0.0         0.0           NaN
2     tt0116391         0.0         0.0           NaN
3     tt0118694  12854953.0    150000.0            PG
4     tt0118852         0.0         0.0             R
...         ...         ...         ...           ...
2560  tt7797670         0.0         0.0           NaN
2561  tt7797790         0.0         0.0           NaN
2562  tt8665056         0.0         0.0           NaN
2563  tt8795764         0.0         0.0            NR
2564  tt9071078         0.0         0.0           NaN

[2565 rows x 4 columns]

In [37]:
tmdb_keepers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2565 entries, 0 to 2564
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2565 non-null   object
 1   revenue        2565 non-null   float64
 2   budget         2565 non-null   float64
 3   certification  816 non-null    object
dtypes: float64(2), object(2)
memory usage: 80.3+ KB

In [38]:
## Example
#from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = tmdb_keepers['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_keepers['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_df_schema = {
    "imdb_id": String(key_len+1), 
    'revenue':Float(),
    'budget': Float(),
    'certification': String(cert_len+1)}

In [39]:
tmdb_keepers.to_sql('tmdb_data',engine,dtype=tmdb_df_schema,if_exists='replace',index=False)

2565

In [40]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

# Testing Queues

In [41]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

In [42]:
q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [43]:
q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0096056,Crime and Punishment,2002.0,None,126

In [44]:
q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [45]:
q = """SELECT * FROM title_ratings LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1967
1  tt0000002            5.8       264
2  tt0000005            6.2      2610
3  tt0000006            5.2       181
4  tt0000007            5.4       816

In [46]:
q = """SELECT * FROM tmdb_data LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0113026         0.0  10000000.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None